IDEA StatiCa Open Model
OpenModel.Beam Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of Elements 1D
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<Beam> Beam { get; set; }
Public Property Beam As List(Of Beam)
	Get
	Set
public:
property List<Beam^>^ Beam {
	List<Beam^>^ get ();
	void set (List<Beam^>^ value);
}
Property Value
Type: List<Beam>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace